gzehentner/ESP32_Projects/Wasserstand_ESP_V05/src/server.cpp
  server.send(200, "text/javascript", message);
}

//*********************************************************************************
// // Create a dynamic range slider to display the current value, with JavaScript:
// void handleSliderJs()
// {
//*********************************************************************************
//   String message;
//   message += F("const url ='json';\n"
//                "var slider = document.getElementById('myRange');"
//                "var output = document.getElementById('demo');"
//                "output.innerHTML = slider.value; // Display the default slider value"

//                "// Update the current slider value (each time you drag the slider handle)"
//                "slider.oninput = function() {"
//                "  output.innerHTML = this.value;"
//                "}");

//   server.send(200, "text/javascript", message);
// }
//*********************************************************************************


//*********************************************************************************
void handleCommand()
//*********************************************************************************
{

  int tempVal = 0;

  // receive command and handle accordingly
  Serial.println(F("D223 handleCommand"));
  for (uint8_t i = 0; i < server.args(); i++)
  {
    Serial.print(server.argName(i));
    Serial.print(F(": "));
    Serial.println(server.arg(i));
  }
  if (server.argName(0) == "toggle") // the parameter which was sent to this server
  {
    //reloadDone = 0;
    //Serial.println("reloadDone -> 0 -- Cmd = toggle");

    if (server.arg(0) == "a") // the value for that parameter
    {
      Serial.println(F("D232 toggle debug switch"));

      if (debugLevelSwitches == 1)
      { // toggle: if the pin was on - switch it of and vice versa
        debugLevelSwitches=0;
      }
      else
      {
        debugLevelSwitches=1;
      }
    }
    if (server.arg(0) == "1") // the value for that parameter
    {
      Serial.println(F("D232 toggle ahh"));
      if (simVal_AHH == 1) {simVal_AHH = 0;} else {simVal_AHH = 1;}
      digitalWrite(GPin_AHH, simVal_AHH);
    }
    if (server.arg(0) == "2") // the value for that parameter
    {
      Serial.println(F("D232 toggle ah"));
      if (simVal_AH == 1) {simVal_AH = 0;} else {simVal_AH = 1;}
      digitalWrite(GPin_AH, simVal_AH);
    }
    if (server.arg(0) == "3") // the value for that parameter
    {
      Serial.println(F("D232 toggle al"));
      if (simVal_AL == 1) {simVal_AL = 0;} else {simVal_AL = 1;}
      digitalWrite(GPin_AL, simVal_AL);
    }
    if (server.arg(0) == "4") // the value for that parameter
    {
      Serial.println(F("D232 toggle all"));
      // if (simVal_ALL == 1) {simVal_ALL = 0;} else {simVal_ALL = 1;}
      // digitalWrite(GPin_AHH, simVal_ALL);
      // Serial.println(simVal_ALL);
    }
    if (server.arg(0) == "5") // the value for that parameter(led))
    {
      Serial.println(F("D232 toggle LED"));
      if (digitalRead(builtin_led))
      { // toggle: if the pin was on - switch it of and vice versa
        digitalWrite(builtin_led, LOW);
        sendToClient = 1;  // enable sending to client in Wasserstand_V5.cpp
      }
      else
      {
        digitalWrite(builtin_led, HIGH);
        if (isLiveSystem==0) {
          sendToClient = 0;  // disable sending to client in dev version ofWasserstand_V5.cpp
        }
      }
    }
  }
  else if (server.argName(0) == "CMD" && server.arg(0) == "RESET") // Example how to reset the module. Just send ?CMD=RESET
  {
    Serial.println(F("D238 will reset"));
    ESP.restart();
  }

  // else if (server.argName(0) == "reloaded" && server.arg(0) == "true") 
  // {
  //   Serial.println(F("D238 will reload"));
  //   reloadDone = 1;
  // }

  Serial.print("reloadDone : "); Serial.println(reloadDone);

// if (reloadDone==0) {
  if (false) {
    server.send(200, "text/html", "<html><body><script>localStorage.setItem('reloaded', 'true'); location.reload();</script></body></html>");
    reloadDone = 1;
    Serial.println("200");
  } else {
    reloadDone = 1;
    server.send(204, "text/plain", "No Content"); // this page doesn't send back content --> 204
    Serial.println("204");
  }
  
  setPegelforSimulation();

}

void handleData() {
// receives data from a remote board 
// and saves data to local variables
// it uses similar method like the command processing: 
// we receive parameters and store them in variables

  uint8_t counter = 0; // will count valid values
  for (uint8_t i = 0; i < server.args(); i++) {
    Serial.print(server.argName(i));
    Serial.print(F(": "));
    Serial.println(server.arg(i));
    if (server.argName(i) == "board")
    {
      remoteBoardId = server.arg(0).toInt();
      counter++;
    }
    else if (server.argName(i) == "levelAct")
    {
      remoteLevelAct = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "debug_level_switches")
    {
      remoteDebugLevelSwitches = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AHH")
    {
      remoteAHH = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AH")
    {
      remoteAH = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AL")
    {
      remoteAL = server.arg(i).toInt();
      counter++;
    }
  }
  //example for errorhandling
  if (counter >= 1)
  {
    remoteLastMessage = millis() / 1000; // store the timestamp 
    remoteMessagesSucessfull++; // increase successfull submits
  }
  server.send(200, "text/plain", "OK");
}

// *** Remote Page ***  r.htm
void handlePageR()
{
  Serial.println("handlePageR entered");
  
  String message;
  addTop(message);
  message += F("<article>\n"
               "<h2>Remote Module</h2>\n"
               "<p>This page shows values which were received from a remote module.<p>\n"
               "<table>\n"
               "<tr><th>variable</th><th>value</th></tr>\n"

               "<tr><td>remoteBoardId</td><td>");
  message += remoteBoardId;
  message += F("</td></tr>\n"

